#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

module.email_function.data.external.main: Reading...
module.email_function.data.external.main: Read complete after 0s [id=-]
module.email_function.data.archive_file.main: Reading...
module.email_function.data.archive_file.main: Read complete after 0s [id=80a702ac9df89c65420d4d10d2b15004fdaff8df]
module.email_function.terraform_data.commit_sha: Refreshing state... [id=ab4eeaef-5c52-49e0-08f1-ac9347cdea4a]
data.aws_cloudfront_origin_request_policy.managed_cors_s3_origin: Reading...
data.aws_caller_identity.current: Reading...
aws_cloudfront_origin_access_control.care_bear_shooter_build_bucket: Refreshing state... [id=E9UD6HRKKYL4H]
data.aws_cloudfront_cache_policy.managed_caching_optimized: Reading...
module.email_function.data.aws_ssm_parameter.custom[0]: Reading...
data.aws_iam_openid_connect_provider.github: Reading...
aws_cloudwatch_event_bus.api_gateway: Refreshing state... [id=api-gateway]
aws_s3_account_public_access_block.main: Refreshing state... [id=220746603587]
aws_cloudwatch_metric_alarm.lambda_throttles: Refreshing state... [id=lambda-throttles]
aws_api_gateway_rest_api.main: Refreshing state... [id=xguhlotnsl]
data.aws_caller_identity.current: Read complete after 0s [id=220746603587]
module.email_function.data.aws_kms_alias.ssm: Reading...
aws_cloudwatch_metric_alarm.lambda_errors: Refreshing state... [id=lambda-errors]
data.aws_cloudfront_cache_policy.managed_caching_optimized: Read complete after 1s [id=b2884449-e4de-46a7-ac36-70bc7f1ddd6d]
aws_s3_bucket.aws_config: Refreshing state... [id=config-bucket-220746603587]
data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::220746603587:oidc-provider/token.actions.githubusercontent.com]
aws_s3_bucket.care_bear_shooter_build: Refreshing state... [id=care-bear-shooter-build-220746603587]
data.aws_cloudfront_origin_request_policy.managed_cors_s3_origin: Read complete after 1s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway]
aws_api_gateway_account.main: Refreshing state... [id=api-gateway-account]
module.email_function.data.aws_ssm_parameter.custom[0]: Read complete after 1s [id=/email-function/mailgun-api-key]
aws_api_gateway_resource.email_function: Refreshing state... [id=7af8s0]
aws_cloudwatch_log_group.api_gateway_stage_default: Refreshing state... [id=API-Gateway-Execution-Logs_xguhlotnsl/default]
module.email_function.aws_api_gateway_model.request_body: Refreshing state... [id=2vo1yf]
aws_cloudwatch_metric_alarm.api_gateway_5xx_error: Refreshing state... [id=api-gateway-5xx-error]
module.email_function.data.aws_kms_alias.ssm: Read complete after 1s [id=arn:aws:kms:eu-central-1:220746603587:alias/aws/ssm]
aws_api_gateway_request_validator.validate_request_body: Refreshing state... [id=aijdpj]
module.email_function.aws_iam_role.main: Refreshing state... [id=terraform-20240206183643547800000002]
aws_iam_role.api_gateway_eventbridge: Refreshing state... [id=terraform-20240206162421745900000001]
module.email_function.aws_cloudwatch_event_rule.main: Refreshing state... [id=arn:aws:events:eu-central-1:220746603587:event-bus/api-gateway/terraform-20240207141348821200000001]
module.email_function.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-xguhlotnsl-7af8s0-POST-200]
module.email_function.aws_api_gateway_method.main: Refreshing state... [id=agm-xguhlotnsl-7af8s0-POST]
module.email_function.aws_lambda_function.main: Refreshing state... [id=email-function]
module.email_function.aws_api_gateway_integration_response.response_200: Refreshing state... [id=agir-xguhlotnsl-7af8s0-POST-200]
module.email_function.aws_api_gateway_integration.main: Refreshing state... [id=agi-xguhlotnsl-7af8s0-POST]
aws_api_gateway_deployment.main: Refreshing state... [id=d4gr0j]
aws_api_gateway_stage.default: Refreshing state... [id=ags-xguhlotnsl-default]
aws_api_gateway_method_settings.all: Refreshing state... [id=xguhlotnsl-default-*/*]
module.email_function.aws_lambda_permission.api_gateway: Refreshing state... [id=terraform-20240207142308376800000001]
module.email_function.aws_cloudwatch_event_target.main: Refreshing state... [id=arn:aws:events:eu-central-1:220746603587:event-bus/api-gateway-terraform-20240207141348821200000001-terraform-20240207141349124600000003]
aws_iam_role.care_bear_shooter_build_uploader: Refreshing state... [id=care-bear-shooter-build-uploader]
aws_s3_bucket_cors_configuration.care_bear_shooter_build: Refreshing state... [id=care-bear-shooter-build-220746603587]
aws_cloudfront_distribution.care_bear_shooter_build: Refreshing state... [id=E3GY8A42OQ8RFW]
aws_iam_role.aws_config: Refreshing state... [id=aws-config]
aws_s3_bucket_lifecycle_configuration.aws_config: Refreshing state... [id=config-bucket-220746603587]
aws_s3_bucket_policy.care_bear_shooter_build_cloudfront: Refreshing state... [id=care-bear-shooter-build-220746603587]
aws_config_configuration_recorder.default: Refreshing state... [id=default]
aws_config_delivery_channel.default: Refreshing state... [id=default]
aws_config_configuration_recorder_status.default: Refreshing state... [id=default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.email_function.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "email-function"
      ~ last_modified                  = "2024-02-07T14:31:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "pq0GNGgCBPWQPW2Qm9k1dS0jMcz6qH61SGEQNNadcvI=" -> "XDhTsXYgkkOpE6dsS+4TfiGlik2szPfTWDBUVTnzBns="
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COMMIT_SHA" = "4307afad71eb77a0abad0e49ac751bfe00add41c"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.email_function.terraform_data.commit_sha must be replaced
-/+ resource "terraform_data" "commit_sha" {
      ~ id               = "ab4eeaef-5c52-49e0-08f1-ac9347cdea4a" -> (known after apply)
      ~ input            = "4307afad71eb77a0abad0e49ac751bfe00add41c" -> "9e601312c393ec20fe2dfc51969466327147a440"
      ~ output           = "4307afad71eb77a0abad0e49ac751bfe00add41c" -> (known after apply)
      ~ triggers_replace = "pq0GNGgCBPWQPW2Qm9k1dS0jMcz6qH61SGEQNNadcvI=" -> "XDhTsXYgkkOpE6dsS+4TfiGlik2szPfTWDBUVTnzBns="
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>